In [39]:
import pandas as pd
from sqlalchemy import create_engine

In [8]:
diets_csv = './diets.csv'
diets_df = pd.read_csv(diets_csv)
diets_df.head()

  Category: All categories              Unnamed: 1
0                      NaN                     NaN
1                    Month  diets: (United States)
2                  2012-02                      82
3                  2012-03                      80
4                  2012-04                     100

In [99]:
#Clean up data
#Drop rows
diets_df=diets_df.drop([0,1])
#rename columns
diets_df=diets_df.rename(columns={'Category: All categories': 'month', 'diets score': 'score'})
diets_df.head()

     month score
0  2012-02    82
1  2012-03    80
2  2012-04   100
3  2012-05    86
4  2012-06    81

In [100]:
diets_df.head()

     month score
0  2012-02    82
1  2012-03    80
2  2012-04   100
3  2012-05    86
4  2012-06    81

In [56]:
fitness_apps_csv = './fitness_apps.csv'
fitness_apps_df = pd.read_csv(fitness_apps_csv)
fitness_apps_df.head()

  Category: All categories                     Unnamed: 1
0                      NaN                            NaN
1                    Month  fitness apps: (United States)
2                  2012-02                             42
3                  2012-03                             39
4                  2012-04                             46

In [61]:
fitness_apps_df=pd.DataFrame(fitness_apps_df)
fitness_apps_df.head()

     month Unnamed: 1
2  2012-02         42
3  2012-03         39
4  2012-04         46
5  2012-05         40
6  2012-06         40

In [94]:
#Clean up data
#Drop rows
#fitness_apps_df=fitness_apps_df.drop([0,1])
fitness_apps_df=fitness_apps_df.rename(columns={'Category: All categories': 'month', 'fitness apps score': 'score'})
#reset index
#fitness_apps_df=fitness_apps_df.reset_index()
fitness_apps_df.head()

     month score
0  2012-02    42
1  2012-03    39
2  2012-04    46
3  2012-05    40
4  2012-06    40

In [15]:
gym_membership_csv = './gym_membership.csv'
gym_membership_df = pd.read_csv(gym_membership_csv)
gym_membership_df.head()

  Category: All categories                       Unnamed: 1
0                      NaN                              NaN
1                    Month  gym membership: (United States)
2                  2012-02                               44
3                  2012-03                               35
4                  2012-04                               40

In [96]:
#Clean up data
#Drop rows
gym_membership_df=gym_membership_df.drop([0,1])
#rename columns
gym_membership_df=gym_membership_df.rename(columns={'Category: All categories': 'month', 'gym membership score': 'score'})
gym_membership_df.head()

     month score
2  2012-04    40
3  2012-05    42
4  2012-06    45
5  2012-07    44
6  2012-08    50

In [98]:
gym_membership_df=pd.DataFrame(gym_membership_df)
gym_membership_df.head()

     month score
2  2012-04    40
3  2012-05    42
4  2012-06    45
5  2012-07    44
6  2012-08    50

In [88]:
#postgresql://postgres:Sophia0818$@localhost:5432/employee_db
protocol = 'postgresql'
username = 'postgres'
password = 'Sophia0818$'
host = 'localhost'
port = '5432'
database_name = 'google_trends'
rds_connection_string = f'{protocol}://{username}:{password}@{host}:{port}/{database_name}'
engine = create_engine(rds_connection_string)

In [91]:
engine.table_names()

C:\Users\lynds\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  """Entry point for launching an IPython kernel.

['diets', 'gym_membership_df', 'fitness_apps_df']

In [105]:
gym_membership_df.to_sql(name='gym_membership_df', con=engine, if_exists='append', index=False)

In [106]:
fitness_apps_df.to_sql(name='fitness_apps_df', con=engine, if_exists='append', index=False)

In [107]:
diets_df.to_sql(name='diets_df', con=engine, if_exists='append', index=False)